Revit 2027 API
SpotDimension.CanFlip Method
 Verifies that the direction of the dimension can be flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFlip()
Public Function CanFlip As Boolean
public:
bool CanFlip()
member CanFlip : unit -> bool
Return Value
Boolean
 True if the element can be flipped, false otherwise.
Remarks
 Currently, flipping only allowed for non-pinned AlignmentStationLabels.
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace